package leetcode.backTracking;

public class Documents {

//    使用回溯法的明显标志
//            1. 排列、组合（子集、幂集、字符全排列）。 在传值时，对于排列问题，是要删掉单个用过的元素；组合问题，是删掉前面所有的元素。
//            2. 数组、字符串，给定一个特定的规则，尝试搜索迭代找到某个解。
//            3. 二维数组下的DFS搜索（八皇后、黄金矿工、数独）
//            4. 切割，子集，棋盘

    //组合 39 40   全排列 46 47   子集 78 90



//    代码框架
//
//    result = []
//    def backtrack(路径, 选择列表):
//        if 满足结束条件:
//            result.add(路径)
//            return
//
//        for 选择 in 选择列表:
//            做选择
//            backtrack(路径, 选择列表)
//            撤销选择

}